In [1]:
import pandas as pd
import numpy as np

sample = pd.DataFrame(np.random.randn(4, 5),
                      index=['one', 'two', 'three', 'four'],
                     columns=['a', 'b', 'c', 'd', 'e'])
sample

              a         b         c         d         e
one   -0.861635  0.099263  0.474080  0.625231 -0.005806
two   -1.378783 -0.490933 -0.857955 -1.241864  0.570235
three -0.316604  2.075977  1.025889 -0.345815  0.110465
four  -0.386646 -1.106194  1.394013 -0.170926  1.004646

In [2]:
sample[['a', 'b']]

              a         b
one   -0.861635  0.099263
two   -1.378783 -0.490933
three -0.316604  2.075977
four  -0.386646 -1.106194

# 获取指定的行列

ix --> 已过时，不建议使用
iloc -->使用数字作为索引
loc -->使用列或者行名作为索引

In [3]:
sample.ix[1:3, ['a','e']]

c:\users\administrator\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              a         e
two   -1.378783  0.570235
three -0.316604  0.110465

In [4]:
sample.iloc[0:2,1:3]   #取行、列都是左闭右开取值

            b         c
one  0.099263  0.474080
two -0.490933 -0.857955

In [5]:
sample.loc['one':'three', 'a':'d']   #左右两端都取

              a         b         c         d
one   -0.861635  0.099263  0.474080  0.625231
two   -1.378783 -0.490933 -0.857955 -1.241864
three -0.316604  2.075977  1.025889 -0.345815

# sample['a']和sample[['a']]的区别
第一个返回的是个Series，双[['a']]返回的是Dataframe

In [6]:
type(sample['a'])

pandas.core.series.Series

In [7]:
type(sample[['a']])

pandas.core.frame.DataFrame

### 创建、删除行列

#### 创建一列

In [8]:
sample = pd.DataFrame(np.random.randn(4, 5),
                     columns=['a', 'b', 'c', 'd', 'e'])

sample['new_col1'] = sample['a'] - sample['b']
sample

          a         b         c         d         e  new_col1
0 -0.240393 -1.012494 -0.370471  1.654986 -0.592012  0.772102
1  0.855222  0.085469 -0.170632  0.789198 -2.227086  0.769753
2  0.356484  0.243671 -0.016530 -0.402320  0.190267  0.112813
3 -1.581579 -0.266709 -1.604680  0.874044 -1.509535 -1.314871

In [9]:
sample['new_col2'] = 2     #广播到每一个位置
sample

          a         b         c         d         e  new_col1  new_col2
0 -0.240393 -1.012494 -0.370471  1.654986 -0.592012  0.772102         2
1  0.855222  0.085469 -0.170632  0.789198 -2.227086  0.769753         2
2  0.356484  0.243671 -0.016530 -0.402320  0.190267  0.112813         2
3 -1.581579 -0.266709 -1.604680  0.874044 -1.509535 -1.314871         2

#### 创建多列

In [10]:
#使用assign需要注意新的列名不要加双引号，并且不会修改自身，要重新赋值给新的变量
sample_new = sample.assign(new_col3 = sample['a'] - sample['b'],
             new_col4 = 3)
sample_new

,a,b,c,d,e,new_col1,new_col2,new_col3,new_col4
0,-0.240393,-1.012494,-0.370471,1.654986,-0.592012,0.772102,2,0.772102,3
1,0.855222,0.085469,-0.170632,0.789198,-2.227086,0.769753,2,0.769753,3
2,0.356484,0.243671,-0.016530,-0.402320,0.190267,0.112813,2,0.112813,3
3,-1.581579,-0.266709,-1.604680,0.874044,-1.509535,-1.314871,2,-1.314871,3

#### 删除某列

In [11]:
sample

          a         b         c         d         e  new_col1  new_col2
0 -0.240393 -1.012494 -0.370471  1.654986 -0.592012  0.772102         2
1  0.855222  0.085469 -0.170632  0.789198 -2.227086  0.769753         2
2  0.356484  0.243671 -0.016530 -0.402320  0.190267  0.112813         2
3 -1.581579 -0.266709 -1.604680  0.874044 -1.509535 -1.314871         2

In [12]:
# 此操作不会改变sample内容，需要重新赋值才能保存
# axis默认是0，即删除行，如果需要删除列需要改为 axis=1
# 删除多列使用drop(['a', 'b'], axis=1)
# 删除指定的多行 sample.drop([1,3])， 不能使用[1:3]这种形式
sample.drop('a', axis=1)

          b         c         d         e  new_col1  new_col2
0 -1.012494 -0.370471  1.654986 -0.592012  0.772102         2
1  0.085469 -0.170632  0.789198 -2.227086  0.769753         2
2  0.243671 -0.016530 -0.402320  0.190267  0.112813         2
3 -0.266709 -1.604680  0.874044 -1.509535 -1.314871         2

## 查询

In [13]:
sample = pd.DataFrame({'name':['Bob','Lindy','Mark',
                              'Miki','Sully','Rose'],
                       'score':[98,78,87,77,65,67],
                       'group':[1,1,1,2,1,2]})
sample

   group   name  score
0      1    Bob     98
1      1  Lindy     78
2      1   Mark     87
3      2   Miki     77
4      1  Sully     65
5      2   Rose     67

In [14]:
sample.score > 70

0     True
1     True
2     True
3     True
4    False
5    False
Name: score, dtype: bool

In [15]:
sample.loc[5, 'group'] = 3
sample

   group   name  score
0      1    Bob     98
1      1  Lindy     78
2      1   Mark     87
3      2   Miki     77
4      1  Sully     65
5      3   Rose     67

In [16]:
sample[sample.score > 70]

   group   name  score
0      1    Bob     98
1      1  Lindy     78
2      1   Mark     87
3      2   Miki     77

In [17]:
sample.query('group == 1 | group == 3')

   group   name  score
0      1    Bob     98
1      1  Lindy     78
2      1   Mark     87
4      1  Sully     65
5      3   Rose     67

In [18]:
# between(left, right, inclusive=True)
# True包含边界值， False不包含边界值
# 默认为True
sample['score'].between(78,98,inclusive=False)

0    False
1    False
2     True
3    False
4    False
5    False
Name: score, dtype: bool

In [19]:
sample[sample['score'].between(78,98,inclusive=False)]

   group  name  score
2      1  Mark     87

In [20]:
sample[sample['name'].isin(['Bob','Lindy'])]

   group   name  score
0      1    Bob     98
1      1  Lindy     78

### 表之间连接，合并操作

# 排序（重要）

In [21]:
sample=pd.DataFrame({'name':['Bob','Lindy','Mark','Miki','Sully','Rose'],
                     'score':[98,78,87,77,77,np.nan],
                     'group':[1,1,1,2,1,2],})
sample

   group   name  score
0      1    Bob   98.0
1      1  Lindy   78.0
2      1   Mark   87.0
3      2   Miki   77.0
4      1  Sully   77.0
5      2   Rose    NaN

In [22]:
# ascending指的排序顺序，默认是True，升序，False为降序
# na_position : {‘first’, ‘last’}, default ‘last’
# first puts NaNs at the beginning, last puts NaNs at the end
sample.sort_values('score',ascending=True,na_position='last')

   group   name  score
3      2   Miki   77.0
4      1  Sully   77.0
1      1  Lindy   78.0
2      1   Mark   87.0
0      1    Bob   98.0
5      2   Rose    NaN

In [23]:
# 多列排序
sample.sort_values(['group', 'score'])
# 先以group排序，之后在group相同序之内对score排序

   group   name  score
4      1  Sully   77.0
1      1  Lindy   78.0
2      1   Mark   87.0
0      1    Bob   98.0
3      2   Miki   77.0
5      2   Rose    NaN

In [24]:
sample['score'].rank(method='first')

0    5.0
1    3.0
2    4.0
3    1.0
4    2.0
5    NaN
Name: score, dtype: float64

### 分组汇总groupby（很重要，记住）

In [25]:
sample = pd.read_csv('sample.csv', encoding='gbk')
sample.head()    #取前部分
sample.tail()    #取后部分
sample.sample(3) #随机取值

   chinese  class  grade  math   name
3       56      2      2  77.0   Miki
2       86      1      1  87.0   Mark
4       77      1      2  77.0  Sully

In [26]:
sample

   chinese  class  grade  math   name
0       88      1      1  98.0    Bob
1       78      1      1  78.0  Lindy
2       86      1      1  87.0   Mark
3       56      2      2  77.0   Miki
4       77      1      2  77.0  Sully
5       54      2      2   NaN   Rose

#### 分类方式(注意agg的使用)

In [27]:
sample.groupby('grade')[['chinese']].max()

       chinese
grade
1           88
2           77

In [28]:
sample[['chinese']].groupby(sample['grade']).max()

       chinese
grade
1           88
2           77

In [29]:
sample.groupby('grade')[['chinese']].agg(['max','min','mean'])

      chinese
          max min       mean
grade
1          88  78  84.000000
2          77  54  62.333333

In [30]:
sam_group = sample.groupby('class')
sam_group.groups
# 返回一个字典，字典的内容是行位置

{1: Int64Index([0, 1, 2, 4], dtype='int64'),
 2: Int64Index([3, 5], dtype='int64')}

### 拆分，堆叠列

#### 拆分（pivot_table, pandas的方法，不是对象的方法）

In [31]:
table = pd.DataFrame({'cust_id':[10001,10001,10002,10002,10003],
                      'type':['Normal','Special_offer',\
                              'Normal','Special_offer','Special_offer'],
                      'Monetary':[3608,420,1894,3503,4567]})

In [32]:
table

   Monetary  cust_id           type
0      3608    10001         Normal
1       420    10001  Special_offer
2      1894    10002         Normal
3      3503    10002  Special_offer
4      4567    10003  Special_offer

In [33]:
pd.pivot_table(table, index='cust_id', columns='type',values='Monetary')

type     Normal  Special_offer
cust_id
10001    3608.0          420.0
10002    1894.0         3503.0
10003       NaN         4567.0

In [34]:
 df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],                    
                    "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [35]:
table1 = pd.pivot_table(table,index='cust_id',
                        columns='type',
                        values='Monetary',
                        fill_value=0,
                        aggfunc=np.sum).reset_index()
table1

type  cust_id  Normal  Special_offer
0       10001    3608            420
1       10002    1894           3503
2       10003       0           4567

In [36]:
table2 = pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc='sum')
table2
# 每种类别只会填充一个数值，填充的数值由vaalue决定，填充值的计算
# 方法由aggfunc决定，默认是'mean'

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

#### 堆叠（melt）

#### 2. 条件赋值

In [38]:
sample = pd.DataFrame({'name':['Bob','Lindy','Mark',
                               'Miki','Sully','Rose'],
                       'score':[99,78,999,77,77,np.nan],
                       'group':[1,1,1,2,1,2],})
sample['score'].apply(lambda x:x > 90)

0     True
1    False
2     True
3    False
4    False
5    False
Name: score, dtype: bool

In [39]:
sample.score.replace(999,np.nan)

0    99.0
1    78.0
2     NaN
3    77.0
4    77.0
5     NaN
Name: score, dtype: float64

In [40]:
sample.replace({'score':{999:np.nan},
                'name':{'Bob':np.nan}})

   group   name  score
0      1    NaN   99.0
1      1  Lindy   78.0
2      1   Mark    NaN
3      2   Miki   77.0
4      1  Sully   77.0
5      2   Rose    NaN

## 常用方法apply，记住！

### apply和map的区别？

In [41]:
sample['score'].apply(lambda x:x > 90)

0     True
1    False
2     True
3    False
4    False
5    False
Name: score, dtype: bool

In [42]:
sample.groupby(['group'])['name'].apply(list)

group
1    [Bob, Lindy, Mark, Sully]
2                 [Miki, Rose]
Name: name, dtype: object

In [43]:
def transform(row):
    if row['group'] == 1:
        return ('class1')
    elif row['group'] == 2:
        return ('class2')  
sample.apply(transform,axis=1)

0    class1
1    class1
2    class1
3    class2
4    class1
5    class2
dtype: object

In [44]:
sample.assign(class_n = sample.apply(transform,axis=1))

   group   name  score class_n
0      1    Bob   99.0  class1
1      1  Lindy   78.0  class1
2      1   Mark  999.0  class1
3      2   Miki   77.0  class2
4      1  Sully   77.0  class1
5      2   Rose    NaN  class2

In [45]:
sample = sample.copy()
sample.loc[sample.group==1,'class_n']='class1'
sample.loc[sample.group==2,'class_n']='class2'

### 交叉表

In [46]:
pd.crosstab(sample['group'], sample['name'])
# 这里的0，1是个计数，可以为2，3等等
# 和下面使用groupby进行计数是一个原理

name   Bob  Lindy  Mark  Miki  Rose  Sully
group
1        1      1     1     0     0      1
2        0      0     0     1     1      0

In [47]:
sample.groupby(['group', 'name']).count()

             score  class_n
group name
1     Bob        1        1
      Lindy      1        1
      Mark       1        1
      Sully      1        1
2     Miki       1        1
      Rose       0        1